GopalSaraf/Practicals/PSDL/include/proc/pic18lf4431.inc
// Register: CAP1CON
#define CAP1CON CAP1CON
CAP1CON                                  equ 0F63h
// bitfield definitions
CAP1CON_CAP1M_POSN                       equ 0000h
CAP1CON_CAP1M_POSITION                   equ 0000h
CAP1CON_CAP1M_SIZE                       equ 0004h
CAP1CON_CAP1M_LENGTH                     equ 0004h
CAP1CON_CAP1M_MASK                       equ 000Fh
CAP1CON_CAP1TMR_POSN                     equ 0005h
CAP1CON_CAP1TMR_POSITION                 equ 0005h
CAP1CON_CAP1TMR_SIZE                     equ 0001h
CAP1CON_CAP1TMR_LENGTH                   equ 0001h
CAP1CON_CAP1TMR_MASK                     equ 0020h
CAP1CON_CAP1REN_POSN                     equ 0006h
CAP1CON_CAP1REN_POSITION                 equ 0006h
CAP1CON_CAP1REN_SIZE                     equ 0001h
CAP1CON_CAP1REN_LENGTH                   equ 0001h
CAP1CON_CAP1REN_MASK                     equ 0040h
CAP1CON_CAP1M0_POSN                      equ 0000h
CAP1CON_CAP1M0_POSITION                  equ 0000h
CAP1CON_CAP1M0_SIZE                      equ 0001h
CAP1CON_CAP1M0_LENGTH                    equ 0001h
CAP1CON_CAP1M0_MASK                      equ 0001h
CAP1CON_CAP1M1_POSN                      equ 0001h
CAP1CON_CAP1M1_POSITION                  equ 0001h
CAP1CON_CAP1M1_SIZE                      equ 0001h
CAP1CON_CAP1M1_LENGTH                    equ 0001h
CAP1CON_CAP1M1_MASK                      equ 0002h
CAP1CON_CAP1M2_POSN                      equ 0002h
CAP1CON_CAP1M2_POSITION                  equ 0002h
CAP1CON_CAP1M2_SIZE                      equ 0001h
CAP1CON_CAP1M2_LENGTH                    equ 0001h
CAP1CON_CAP1M2_MASK                      equ 0004h
CAP1CON_CAP1M3_POSN                      equ 0003h
CAP1CON_CAP1M3_POSITION                  equ 0003h
CAP1CON_CAP1M3_SIZE                      equ 0001h
CAP1CON_CAP1M3_LENGTH                    equ 0001h
CAP1CON_CAP1M3_MASK                      equ 0008h

// Register: CAP3BUFL
#define CAP3BUFL CAP3BUFL
CAP3BUFL                                 equ 0F64h

// Register: CAP3BUFH
#define CAP3BUFH CAP3BUFH
CAP3BUFH                                 equ 0F65h

// Register: CAP2BUFL
#define CAP2BUFL CAP2BUFL
CAP2BUFL                                 equ 0F66h

// Register: CAP2BUFH
#define CAP2BUFH CAP2BUFH
CAP2BUFH                                 equ 0F67h

// Register: CAP1BUFL
#define CAP1BUFL CAP1BUFL
CAP1BUFL                                 equ 0F68h

// Register: CAP1BUFH
#define CAP1BUFH CAP1BUFH
CAP1BUFH                                 equ 0F69h

// Register: OVDCONS
#define OVDCONS OVDCONS
OVDCONS                                  equ 0F6Ah
// bitfield definitions
OVDCONS_POUT_POSN                        equ 0000h
OVDCONS_POUT_POSITION                    equ 0000h
OVDCONS_POUT_SIZE                        equ 0008h
OVDCONS_POUT_LENGTH                      equ 0008h
OVDCONS_POUT_MASK                        equ 00FFh
OVDCONS_POUT0_POSN                       equ 0000h
OVDCONS_POUT0_POSITION                   equ 0000h
OVDCONS_POUT0_SIZE                       equ 0001h
OVDCONS_POUT0_LENGTH                     equ 0001h
OVDCONS_POUT0_MASK                       equ 0001h
OVDCONS_POUT1_POSN                       equ 0001h
OVDCONS_POUT1_POSITION                   equ 0001h
OVDCONS_POUT1_SIZE                       equ 0001h
OVDCONS_POUT1_LENGTH                     equ 0001h
OVDCONS_POUT1_MASK                       equ 0002h
OVDCONS_POUT2_POSN                       equ 0002h
OVDCONS_POUT2_POSITION                   equ 0002h
OVDCONS_POUT2_SIZE                       equ 0001h
OVDCONS_POUT2_LENGTH                     equ 0001h
OVDCONS_POUT2_MASK                       equ 0004h
OVDCONS_POUT3_POSN                       equ 0003h
OVDCONS_POUT3_POSITION                   equ 0003h
OVDCONS_POUT3_SIZE                       equ 0001h
OVDCONS_POUT3_LENGTH                     equ 0001h
OVDCONS_POUT3_MASK                       equ 0008h
OVDCONS_POUT4_POSN                       equ 0004h
OVDCONS_POUT4_POSITION                   equ 0004h
OVDCONS_POUT4_SIZE                       equ 0001h
OVDCONS_POUT4_LENGTH                     equ 0001h
OVDCONS_POUT4_MASK                       equ 0010h
OVDCONS_POUT5_POSN                       equ 0005h
OVDCONS_POUT5_POSITION                   equ 0005h
OVDCONS_POUT5_SIZE                       equ 0001h
OVDCONS_POUT5_LENGTH                     equ 0001h
OVDCONS_POUT5_MASK                       equ 0020h
OVDCONS_POUT6_POSN                       equ 0006h
OVDCONS_POUT6_POSITION                   equ 0006h
OVDCONS_POUT6_SIZE                       equ 0001h
OVDCONS_POUT6_LENGTH                     equ 0001h
OVDCONS_POUT6_MASK                       equ 0040h
OVDCONS_POUT7_POSN                       equ 0007h
OVDCONS_POUT7_POSITION                   equ 0007h
OVDCONS_POUT7_SIZE                       equ 0001h
OVDCONS_POUT7_LENGTH                     equ 0001h
OVDCONS_POUT7_MASK                       equ 0080h

// Register: OVDCOND
#define OVDCOND OVDCOND
OVDCOND                                  equ 0F6Bh
// bitfield definitions
OVDCOND_POVD_POSN                        equ 0000h
OVDCOND_POVD_POSITION                    equ 0000h
OVDCOND_POVD_SIZE                        equ 0008h
OVDCOND_POVD_LENGTH                      equ 0008h
OVDCOND_POVD_MASK                        equ 00FFh
OVDCOND_POVD0_POSN                       equ 0000h
OVDCOND_POVD0_POSITION                   equ 0000h
OVDCOND_POVD0_SIZE                       equ 0001h
OVDCOND_POVD0_LENGTH                     equ 0001h
OVDCOND_POVD0_MASK                       equ 0001h
OVDCOND_POVD1_POSN                       equ 0001h
OVDCOND_POVD1_POSITION                   equ 0001h
OVDCOND_POVD1_SIZE                       equ 0001h
OVDCOND_POVD1_LENGTH                     equ 0001h
OVDCOND_POVD1_MASK                       equ 0002h
OVDCOND_POVD2_POSN                       equ 0002h
OVDCOND_POVD2_POSITION                   equ 0002h
OVDCOND_POVD2_SIZE                       equ 0001h
OVDCOND_POVD2_LENGTH                     equ 0001h
OVDCOND_POVD2_MASK                       equ 0004h
OVDCOND_POVD3_POSN                       equ 0003h
OVDCOND_POVD3_POSITION                   equ 0003h
OVDCOND_POVD3_SIZE                       equ 0001h
OVDCOND_POVD3_LENGTH                     equ 0001h
OVDCOND_POVD3_MASK                       equ 0008h
OVDCOND_POVD4_POSN                       equ 0004h
OVDCOND_POVD4_POSITION                   equ 0004h
OVDCOND_POVD4_SIZE                       equ 0001h
OVDCOND_POVD4_LENGTH                     equ 0001h
OVDCOND_POVD4_MASK                       equ 0010h
OVDCOND_POVD5_POSN                       equ 0005h
OVDCOND_POVD5_POSITION                   equ 0005h
OVDCOND_POVD5_SIZE                       equ 0001h
OVDCOND_POVD5_LENGTH                     equ 0001h
OVDCOND_POVD5_MASK                       equ 0020h
OVDCOND_POVD6_POSN                       equ 0006h
OVDCOND_POVD6_POSITION                   equ 0006h
OVDCOND_POVD6_SIZE                       equ 0001h
OVDCOND_POVD6_LENGTH                     equ 0001h
OVDCOND_POVD6_MASK                       equ 0040h
OVDCOND_POVD7_POSN                       equ 0007h
OVDCOND_POVD7_POSITION                   equ 0007h
OVDCOND_POVD7_SIZE                       equ 0001h
OVDCOND_POVD7_LENGTH                     equ 0001h
OVDCOND_POVD7_MASK                       equ 0080h

// Register: FLTCONFIG
#define FLTCONFIG FLTCONFIG
FLTCONFIG                                equ 0F6Ch
// bitfield definitions
FLTCONFIG_FLTAEN_POSN                    equ 0000h
FLTCONFIG_FLTAEN_POSITION                equ 0000h
FLTCONFIG_FLTAEN_SIZE                    equ 0001h
FLTCONFIG_FLTAEN_LENGTH                  equ 0001h
FLTCONFIG_FLTAEN_MASK                    equ 0001h
FLTCONFIG_FLTAMOD_POSN                   equ 0001h
FLTCONFIG_FLTAMOD_POSITION               equ 0001h
FLTCONFIG_FLTAMOD_SIZE                   equ 0001h
FLTCONFIG_FLTAMOD_LENGTH                 equ 0001h
FLTCONFIG_FLTAMOD_MASK                   equ 0002h
FLTCONFIG_FLTAS_POSN                     equ 0002h
FLTCONFIG_FLTAS_POSITION                 equ 0002h
FLTCONFIG_FLTAS_SIZE                     equ 0001h
FLTCONFIG_FLTAS_LENGTH                   equ 0001h
FLTCONFIG_FLTAS_MASK                     equ 0004h
FLTCONFIG_FLTCON_POSN                    equ 0003h
FLTCONFIG_FLTCON_POSITION                equ 0003h
FLTCONFIG_FLTCON_SIZE                    equ 0001h
FLTCONFIG_FLTCON_LENGTH                  equ 0001h
FLTCONFIG_FLTCON_MASK                    equ 0008h
FLTCONFIG_FLTBEN_POSN                    equ 0004h
FLTCONFIG_FLTBEN_POSITION                equ 0004h
FLTCONFIG_FLTBEN_SIZE                    equ 0001h
FLTCONFIG_FLTBEN_LENGTH                  equ 0001h
FLTCONFIG_FLTBEN_MASK                    equ 0010h
FLTCONFIG_FLTBMOD_POSN                   equ 0005h
FLTCONFIG_FLTBMOD_POSITION               equ 0005h
FLTCONFIG_FLTBMOD_SIZE                   equ 0001h
FLTCONFIG_FLTBMOD_LENGTH                 equ 0001h
FLTCONFIG_FLTBMOD_MASK                   equ 0020h
FLTCONFIG_FLTBS_POSN                     equ 0006h
FLTCONFIG_FLTBS_POSITION                 equ 0006h
FLTCONFIG_FLTBS_SIZE                     equ 0001h
FLTCONFIG_FLTBS_LENGTH                   equ 0001h
FLTCONFIG_FLTBS_MASK                     equ 0040h
FLTCONFIG_BRFEN_POSN                     equ 0007h
FLTCONFIG_BRFEN_POSITION                 equ 0007h
FLTCONFIG_BRFEN_SIZE                     equ 0001h
FLTCONFIG_BRFEN_LENGTH                   equ 0001h
FLTCONFIG_BRFEN_MASK                     equ 0080h

// Register: DTCON
#define DTCON DTCON
DTCON                                    equ 0F6Dh
// bitfield definitions
DTCON_DTA_POSN                           equ 0000h
DTCON_DTA_POSITION                       equ 0000h
DTCON_DTA_SIZE                           equ 0006h
DTCON_DTA_LENGTH                         equ 0006h
DTCON_DTA_MASK                           equ 003Fh
DTCON_DTAPS_POSN                         equ 0006h
DTCON_DTAPS_POSITION                     equ 0006h
DTCON_DTAPS_SIZE                         equ 0002h
DTCON_DTAPS_LENGTH                       equ 0002h
DTCON_DTAPS_MASK                         equ 00C0h
DTCON_DT0_POSN                           equ 0000h
DTCON_DT0_POSITION                       equ 0000h
DTCON_DT0_SIZE                           equ 0001h
DTCON_DT0_LENGTH                         equ 0001h
DTCON_DT0_MASK                           equ 0001h
DTCON_DT1_POSN                           equ 0001h
DTCON_DT1_POSITION                       equ 0001h
DTCON_DT1_SIZE                           equ 0001h
DTCON_DT1_LENGTH                         equ 0001h
DTCON_DT1_MASK                           equ 0002h
DTCON_DT2_POSN                           equ 0002h
DTCON_DT2_POSITION                       equ 0002h
DTCON_DT2_SIZE                           equ 0001h
DTCON_DT2_LENGTH                         equ 0001h
DTCON_DT2_MASK                           equ 0004h
DTCON_DT3_POSN                           equ 0003h
DTCON_DT3_POSITION                       equ 0003h
DTCON_DT3_SIZE                           equ 0001h
DTCON_DT3_LENGTH                         equ 0001h
DTCON_DT3_MASK                           equ 0008h
DTCON_DT4_POSN                           equ 0004h
DTCON_DT4_POSITION                       equ 0004h
DTCON_DT4_SIZE                           equ 0001h
DTCON_DT4_LENGTH                         equ 0001h
DTCON_DT4_MASK                           equ 0010h
DTCON_DT5_POSN                           equ 0005h
DTCON_DT5_POSITION                       equ 0005h
DTCON_DT5_SIZE                           equ 0001h
DTCON_DT5_LENGTH                         equ 0001h
DTCON_DT5_MASK                           equ 0020h
DTCON_DTPS0_POSN                         equ 0006h
DTCON_DTPS0_POSITION                     equ 0006h
DTCON_DTPS0_SIZE                         equ 0001h
DTCON_DTPS0_LENGTH                       equ 0001h
DTCON_DTPS0_MASK                         equ 0040h
DTCON_DTPS1_POSN                         equ 0007h
DTCON_DTPS1_POSITION                     equ 0007h
DTCON_DTPS1_SIZE                         equ 0001h
DTCON_DTPS1_LENGTH                       equ 0001h
DTCON_DTPS1_MASK                         equ 0080h
DTCON_DTA0_POSN                          equ 0000h
DTCON_DTA0_POSITION                      equ 0000h
DTCON_DTA0_SIZE                          equ 0001h
DTCON_DTA0_LENGTH                        equ 0001h
DTCON_DTA0_MASK                          equ 0001h
DTCON_DTA1_POSN                          equ 0001h
DTCON_DTA1_POSITION                      equ 0001h
DTCON_DTA1_SIZE                          equ 0001h
DTCON_DTA1_LENGTH                        equ 0001h
DTCON_DTA1_MASK                          equ 0002h
DTCON_DTA2_POSN                          equ 0002h
DTCON_DTA2_POSITION                      equ 0002h
DTCON_DTA2_SIZE                          equ 0001h
DTCON_DTA2_LENGTH                        equ 0001h
DTCON_DTA2_MASK                          equ 0004h
DTCON_DTA3_POSN                          equ 0003h
DTCON_DTA3_POSITION                      equ 0003h
DTCON_DTA3_SIZE                          equ 0001h
DTCON_DTA3_LENGTH                        equ 0001h
DTCON_DTA3_MASK                          equ 0008h
DTCON_DTA4_POSN                          equ 0004h
DTCON_DTA4_POSITION                      equ 0004h
DTCON_DTA4_SIZE                          equ 0001h
DTCON_DTA4_LENGTH                        equ 0001h
DTCON_DTA4_MASK                          equ 0010h
DTCON_DTA5_POSN                          equ 0005h
DTCON_DTA5_POSITION                      equ 0005h
DTCON_DTA5_SIZE                          equ 0001h
DTCON_DTA5_LENGTH                        equ 0001h
DTCON_DTA5_MASK                          equ 0020h
DTCON_DTAPS0_POSN                        equ 0006h
DTCON_DTAPS0_POSITION                    equ 0006h
DTCON_DTAPS0_SIZE                        equ 0001h
DTCON_DTAPS0_LENGTH                      equ 0001h
DTCON_DTAPS0_MASK                        equ 0040h
DTCON_DTAPS1_POSN                        equ 0007h
DTCON_DTAPS1_POSITION                    equ 0007h
DTCON_DTAPS1_SIZE                        equ 0001h
DTCON_DTAPS1_LENGTH                      equ 0001h
DTCON_DTAPS1_MASK                        equ 0080h

// Register: PWMCON1
#define PWMCON1 PWMCON1
PWMCON1                                  equ 0F6Eh
// bitfield definitions
PWMCON1_OSYNC_POSN                       equ 0000h
PWMCON1_OSYNC_POSITION                   equ 0000h
PWMCON1_OSYNC_SIZE                       equ 0001h
PWMCON1_OSYNC_LENGTH                     equ 0001h
PWMCON1_OSYNC_MASK                       equ 0001h
PWMCON1_UDIS_POSN                        equ 0001h
PWMCON1_UDIS_POSITION                    equ 0001h
PWMCON1_UDIS_SIZE                        equ 0001h
PWMCON1_UDIS_LENGTH                      equ 0001h
PWMCON1_UDIS_MASK                        equ 0002h
PWMCON1_SEVTDIR_POSN                     equ 0003h
PWMCON1_SEVTDIR_POSITION                 equ 0003h
PWMCON1_SEVTDIR_SIZE                     equ 0001h
PWMCON1_SEVTDIR_LENGTH                   equ 0001h
PWMCON1_SEVTDIR_MASK                     equ 0008h
PWMCON1_SEVOPS_POSN                      equ 0004h
PWMCON1_SEVOPS_POSITION                  equ 0004h
PWMCON1_SEVOPS_SIZE                      equ 0004h
PWMCON1_SEVOPS_LENGTH                    equ 0004h
PWMCON1_SEVOPS_MASK                      equ 00F0h
PWMCON1_SEVOPS0_POSN                     equ 0004h
PWMCON1_SEVOPS0_POSITION                 equ 0004h
PWMCON1_SEVOPS0_SIZE                     equ 0001h
PWMCON1_SEVOPS0_LENGTH                   equ 0001h
PWMCON1_SEVOPS0_MASK                     equ 0010h
PWMCON1_SEVOPS1_POSN                     equ 0005h
PWMCON1_SEVOPS1_POSITION                 equ 0005h
PWMCON1_SEVOPS1_SIZE                     equ 0001h
PWMCON1_SEVOPS1_LENGTH                   equ 0001h
PWMCON1_SEVOPS1_MASK                     equ 0020h
PWMCON1_SEVOPS2_POSN                     equ 0006h
PWMCON1_SEVOPS2_POSITION                 equ 0006h
PWMCON1_SEVOPS2_SIZE                     equ 0001h
PWMCON1_SEVOPS2_LENGTH                   equ 0001h
PWMCON1_SEVOPS2_MASK                     equ 0040h
PWMCON1_SEVOPS3_POSN                     equ 0007h
PWMCON1_SEVOPS3_POSITION                 equ 0007h
PWMCON1_SEVOPS3_SIZE                     equ 0001h
PWMCON1_SEVOPS3_LENGTH                   equ 0001h
PWMCON1_SEVOPS3_MASK                     equ 0080h

// Register: PWMCON0
#define PWMCON0 PWMCON0
PWMCON0                                  equ 0F6Fh
// bitfield definitions
PWMCON0_PMOD_POSN                        equ 0000h
PWMCON0_PMOD_POSITION                    equ 0000h
PWMCON0_PMOD_SIZE                        equ 0004h
PWMCON0_PMOD_LENGTH                      equ 0004h
PWMCON0_PMOD_MASK                        equ 000Fh
PWMCON0_PWMEN_POSN                       equ 0004h
PWMCON0_PWMEN_POSITION                   equ 0004h
PWMCON0_PWMEN_SIZE                       equ 0003h
PWMCON0_PWMEN_LENGTH                     equ 0003h
PWMCON0_PWMEN_MASK                       equ 0070h
PWMCON0_PMOD0_POSN                       equ 0000h
PWMCON0_PMOD0_POSITION                   equ 0000h
PWMCON0_PMOD0_SIZE                       equ 0001h
PWMCON0_PMOD0_LENGTH                     equ 0001h
PWMCON0_PMOD0_MASK                       equ 0001h
PWMCON0_PMOD1_POSN                       equ 0001h
PWMCON0_PMOD1_POSITION                   equ 0001h
PWMCON0_PMOD1_SIZE                       equ 0001h
PWMCON0_PMOD1_LENGTH                     equ 0001h
PWMCON0_PMOD1_MASK                       equ 0002h
PWMCON0_PMOD2_POSN                       equ 0002h
PWMCON0_PMOD2_POSITION                   equ 0002h
PWMCON0_PMOD2_SIZE                       equ 0001h
PWMCON0_PMOD2_LENGTH                     equ 0001h
PWMCON0_PMOD2_MASK                       equ 0004h
PWMCON0_PMOD3_POSN                       equ 0003h
PWMCON0_PMOD3_POSITION                   equ 0003h
PWMCON0_PMOD3_SIZE                       equ 0001h
PWMCON0_PMOD3_LENGTH                     equ 0001h
PWMCON0_PMOD3_MASK                       equ 0008h
PWMCON0_PWMEN0_POSN                      equ 0004h
PWMCON0_PWMEN0_POSITION                  equ 0004h
PWMCON0_PWMEN0_SIZE                      equ 0001h
PWMCON0_PWMEN0_LENGTH                    equ 0001h
PWMCON0_PWMEN0_MASK                      equ 0010h
PWMCON0_PWMEN1_POSN                      equ 0005h
PWMCON0_PWMEN1_POSITION                  equ 0005h
PWMCON0_PWMEN1_SIZE                      equ 0001h
PWMCON0_PWMEN1_LENGTH                    equ 0001h
PWMCON0_PWMEN1_MASK                      equ 0020h
PWMCON0_PWMEN2_POSN                      equ 0006h
PWMCON0_PWMEN2_POSITION                  equ 0006h
PWMCON0_PWMEN2_SIZE                      equ 0001h
PWMCON0_PWMEN2_LENGTH                    equ 0001h
PWMCON0_PWMEN2_MASK                      equ 0040h

