GopalSaraf/Practicals/PSDL/include/proc/pic18lf4431.inc
// Register: TRISD
#define TRISD TRISD
TRISD                                    equ 0F95h
// bitfield definitions
TRISD_TRISD0_POSN                        equ 0000h
TRISD_TRISD0_POSITION                    equ 0000h
TRISD_TRISD0_SIZE                        equ 0001h
TRISD_TRISD0_LENGTH                      equ 0001h
TRISD_TRISD0_MASK                        equ 0001h
TRISD_TRISD1_POSN                        equ 0001h
TRISD_TRISD1_POSITION                    equ 0001h
TRISD_TRISD1_SIZE                        equ 0001h
TRISD_TRISD1_LENGTH                      equ 0001h
TRISD_TRISD1_MASK                        equ 0002h
TRISD_TRISD2_POSN                        equ 0002h
TRISD_TRISD2_POSITION                    equ 0002h
TRISD_TRISD2_SIZE                        equ 0001h
TRISD_TRISD2_LENGTH                      equ 0001h
TRISD_TRISD2_MASK                        equ 0004h
TRISD_TRISD3_POSN                        equ 0003h
TRISD_TRISD3_POSITION                    equ 0003h
TRISD_TRISD3_SIZE                        equ 0001h
TRISD_TRISD3_LENGTH                      equ 0001h
TRISD_TRISD3_MASK                        equ 0008h
TRISD_TRISD4_POSN                        equ 0004h
TRISD_TRISD4_POSITION                    equ 0004h
TRISD_TRISD4_SIZE                        equ 0001h
TRISD_TRISD4_LENGTH                      equ 0001h
TRISD_TRISD4_MASK                        equ 0010h
TRISD_TRISD5_POSN                        equ 0005h
TRISD_TRISD5_POSITION                    equ 0005h
TRISD_TRISD5_SIZE                        equ 0001h
TRISD_TRISD5_LENGTH                      equ 0001h
TRISD_TRISD5_MASK                        equ 0020h
TRISD_TRISD6_POSN                        equ 0006h
TRISD_TRISD6_POSITION                    equ 0006h
TRISD_TRISD6_SIZE                        equ 0001h
TRISD_TRISD6_LENGTH                      equ 0001h
TRISD_TRISD6_MASK                        equ 0040h
TRISD_TRISD7_POSN                        equ 0007h
TRISD_TRISD7_POSITION                    equ 0007h
TRISD_TRISD7_SIZE                        equ 0001h
TRISD_TRISD7_LENGTH                      equ 0001h
TRISD_TRISD7_MASK                        equ 0080h
TRISD_RD0_POSN                           equ 0000h
TRISD_RD0_POSITION                       equ 0000h
TRISD_RD0_SIZE                           equ 0001h
TRISD_RD0_LENGTH                         equ 0001h
TRISD_RD0_MASK                           equ 0001h
TRISD_RD1_POSN                           equ 0001h
TRISD_RD1_POSITION                       equ 0001h
TRISD_RD1_SIZE                           equ 0001h
TRISD_RD1_LENGTH                         equ 0001h
TRISD_RD1_MASK                           equ 0002h
TRISD_RD2_POSN                           equ 0002h
TRISD_RD2_POSITION                       equ 0002h
TRISD_RD2_SIZE                           equ 0001h
TRISD_RD2_LENGTH                         equ 0001h
TRISD_RD2_MASK                           equ 0004h
TRISD_RD3_POSN                           equ 0003h
TRISD_RD3_POSITION                       equ 0003h
TRISD_RD3_SIZE                           equ 0001h
TRISD_RD3_LENGTH                         equ 0001h
TRISD_RD3_MASK                           equ 0008h
TRISD_RD4_POSN                           equ 0004h
TRISD_RD4_POSITION                       equ 0004h
TRISD_RD4_SIZE                           equ 0001h
TRISD_RD4_LENGTH                         equ 0001h
TRISD_RD4_MASK                           equ 0010h
TRISD_RD5_POSN                           equ 0005h
TRISD_RD5_POSITION                       equ 0005h
TRISD_RD5_SIZE                           equ 0001h
TRISD_RD5_LENGTH                         equ 0001h
TRISD_RD5_MASK                           equ 0020h
TRISD_RD6_POSN                           equ 0006h
TRISD_RD6_POSITION                       equ 0006h
TRISD_RD6_SIZE                           equ 0001h
TRISD_RD6_LENGTH                         equ 0001h
TRISD_RD6_MASK                           equ 0040h
TRISD_RD7_POSN                           equ 0007h
TRISD_RD7_POSITION                       equ 0007h
TRISD_RD7_SIZE                           equ 0001h
TRISD_RD7_LENGTH                         equ 0001h
TRISD_RD7_MASK                           equ 0080h

// Register: TRISE
#define TRISE TRISE
TRISE                                    equ 0F96h
// bitfield definitions
TRISE_TRISE0_POSN                        equ 0000h
TRISE_TRISE0_POSITION                    equ 0000h
TRISE_TRISE0_SIZE                        equ 0001h
TRISE_TRISE0_LENGTH                      equ 0001h
TRISE_TRISE0_MASK                        equ 0001h
TRISE_TRISE1_POSN                        equ 0001h
TRISE_TRISE1_POSITION                    equ 0001h
TRISE_TRISE1_SIZE                        equ 0001h
TRISE_TRISE1_LENGTH                      equ 0001h
TRISE_TRISE1_MASK                        equ 0002h
TRISE_TRISE2_POSN                        equ 0002h
TRISE_TRISE2_POSITION                    equ 0002h
TRISE_TRISE2_SIZE                        equ 0001h
TRISE_TRISE2_LENGTH                      equ 0001h
TRISE_TRISE2_MASK                        equ 0004h
TRISE_RE0_POSN                           equ 0000h
TRISE_RE0_POSITION                       equ 0000h
TRISE_RE0_SIZE                           equ 0001h
TRISE_RE0_LENGTH                         equ 0001h
TRISE_RE0_MASK                           equ 0001h
TRISE_RE1_POSN                           equ 0001h
TRISE_RE1_POSITION                       equ 0001h
TRISE_RE1_SIZE                           equ 0001h
TRISE_RE1_LENGTH                         equ 0001h
TRISE_RE1_MASK                           equ 0002h
TRISE_RE2_POSN                           equ 0002h
TRISE_RE2_POSITION                       equ 0002h
TRISE_RE2_SIZE                           equ 0001h
TRISE_RE2_LENGTH                         equ 0001h
TRISE_RE2_MASK                           equ 0004h

// Register: ADCHS
#define ADCHS ADCHS
ADCHS                                    equ 0F99h
// bitfield definitions
ADCHS_SASEL_POSN                         equ 0000h
ADCHS_SASEL_POSITION                     equ 0000h
ADCHS_SASEL_SIZE                         equ 0002h
ADCHS_SASEL_LENGTH                       equ 0002h
ADCHS_SASEL_MASK                         equ 0003h
ADCHS_SCSEL_POSN                         equ 0002h
ADCHS_SCSEL_POSITION                     equ 0002h
ADCHS_SCSEL_SIZE                         equ 0002h
ADCHS_SCSEL_LENGTH                       equ 0002h
ADCHS_SCSEL_MASK                         equ 000Ch
ADCHS_SBSEL_POSN                         equ 0004h
ADCHS_SBSEL_POSITION                     equ 0004h
ADCHS_SBSEL_SIZE                         equ 0002h
ADCHS_SBSEL_LENGTH                       equ 0002h
ADCHS_SBSEL_MASK                         equ 0030h
ADCHS_SDSEL_POSN                         equ 0006h
ADCHS_SDSEL_POSITION                     equ 0006h
ADCHS_SDSEL_SIZE                         equ 0002h
ADCHS_SDSEL_LENGTH                       equ 0002h
ADCHS_SDSEL_MASK                         equ 00C0h
ADCHS_GASEL0_POSN                        equ 0000h
ADCHS_GASEL0_POSITION                    equ 0000h
ADCHS_GASEL0_SIZE                        equ 0001h
ADCHS_GASEL0_LENGTH                      equ 0001h
ADCHS_GASEL0_MASK                        equ 0001h
ADCHS_GASEL1_POSN                        equ 0001h
ADCHS_GASEL1_POSITION                    equ 0001h
ADCHS_GASEL1_SIZE                        equ 0001h
ADCHS_GASEL1_LENGTH                      equ 0001h
ADCHS_GASEL1_MASK                        equ 0002h
ADCHS_GCSEL0_POSN                        equ 0002h
ADCHS_GCSEL0_POSITION                    equ 0002h
ADCHS_GCSEL0_SIZE                        equ 0001h
ADCHS_GCSEL0_LENGTH                      equ 0001h
ADCHS_GCSEL0_MASK                        equ 0004h
ADCHS_GCSEL1_POSN                        equ 0003h
ADCHS_GCSEL1_POSITION                    equ 0003h
ADCHS_GCSEL1_SIZE                        equ 0001h
ADCHS_GCSEL1_LENGTH                      equ 0001h
ADCHS_GCSEL1_MASK                        equ 0008h
ADCHS_GBSEL0_POSN                        equ 0004h
ADCHS_GBSEL0_POSITION                    equ 0004h
ADCHS_GBSEL0_SIZE                        equ 0001h
ADCHS_GBSEL0_LENGTH                      equ 0001h
ADCHS_GBSEL0_MASK                        equ 0010h
ADCHS_GBSEL1_POSN                        equ 0005h
ADCHS_GBSEL1_POSITION                    equ 0005h
ADCHS_GBSEL1_SIZE                        equ 0001h
ADCHS_GBSEL1_LENGTH                      equ 0001h
ADCHS_GBSEL1_MASK                        equ 0020h
ADCHS_GDSEL0_POSN                        equ 0006h
ADCHS_GDSEL0_POSITION                    equ 0006h
ADCHS_GDSEL0_SIZE                        equ 0001h
ADCHS_GDSEL0_LENGTH                      equ 0001h
ADCHS_GDSEL0_MASK                        equ 0040h
ADCHS_GDSEL1_POSN                        equ 0007h
ADCHS_GDSEL1_POSITION                    equ 0007h
ADCHS_GDSEL1_SIZE                        equ 0001h
ADCHS_GDSEL1_LENGTH                      equ 0001h
ADCHS_GDSEL1_MASK                        equ 0080h
ADCHS_SASEL0_POSN                        equ 0000h
ADCHS_SASEL0_POSITION                    equ 0000h
ADCHS_SASEL0_SIZE                        equ 0001h
ADCHS_SASEL0_LENGTH                      equ 0001h
ADCHS_SASEL0_MASK                        equ 0001h
ADCHS_SASEL1_POSN                        equ 0001h
ADCHS_SASEL1_POSITION                    equ 0001h
ADCHS_SASEL1_SIZE                        equ 0001h
ADCHS_SASEL1_LENGTH                      equ 0001h
ADCHS_SASEL1_MASK                        equ 0002h
ADCHS_SCSEL0_POSN                        equ 0002h
ADCHS_SCSEL0_POSITION                    equ 0002h
ADCHS_SCSEL0_SIZE                        equ 0001h
ADCHS_SCSEL0_LENGTH                      equ 0001h
ADCHS_SCSEL0_MASK                        equ 0004h
ADCHS_SCSEL1_POSN                        equ 0003h
ADCHS_SCSEL1_POSITION                    equ 0003h
ADCHS_SCSEL1_SIZE                        equ 0001h
ADCHS_SCSEL1_LENGTH                      equ 0001h
ADCHS_SCSEL1_MASK                        equ 0008h
ADCHS_SBSEL0_POSN                        equ 0004h
ADCHS_SBSEL0_POSITION                    equ 0004h
ADCHS_SBSEL0_SIZE                        equ 0001h
ADCHS_SBSEL0_LENGTH                      equ 0001h
ADCHS_SBSEL0_MASK                        equ 0010h
ADCHS_SBSEL1_POSN                        equ 0005h
ADCHS_SBSEL1_POSITION                    equ 0005h
ADCHS_SBSEL1_SIZE                        equ 0001h
ADCHS_SBSEL1_LENGTH                      equ 0001h
ADCHS_SBSEL1_MASK                        equ 0020h
ADCHS_SDSEL0_POSN                        equ 0006h
ADCHS_SDSEL0_POSITION                    equ 0006h
ADCHS_SDSEL0_SIZE                        equ 0001h
ADCHS_SDSEL0_LENGTH                      equ 0001h
ADCHS_SDSEL0_MASK                        equ 0040h
ADCHS_SDSEL1_POSN                        equ 0007h
ADCHS_SDSEL1_POSITION                    equ 0007h
ADCHS_SDSEL1_SIZE                        equ 0001h
ADCHS_SDSEL1_LENGTH                      equ 0001h
ADCHS_SDSEL1_MASK                        equ 0080h

// Register: ADCON3
#define ADCON3 ADCON3
ADCON3                                   equ 0F9Ah
// bitfield definitions
ADCON3_SSRC_POSN                         equ 0000h
ADCON3_SSRC_POSITION                     equ 0000h
ADCON3_SSRC_SIZE                         equ 0005h
ADCON3_SSRC_LENGTH                       equ 0005h
ADCON3_SSRC_MASK                         equ 001Fh
ADCON3_ADRS_POSN                         equ 0006h
ADCON3_ADRS_POSITION                     equ 0006h
ADCON3_ADRS_SIZE                         equ 0002h
ADCON3_ADRS_LENGTH                       equ 0002h
ADCON3_ADRS_MASK                         equ 00C0h
ADCON3_SSRC0_POSN                        equ 0000h
ADCON3_SSRC0_POSITION                    equ 0000h
ADCON3_SSRC0_SIZE                        equ 0001h
ADCON3_SSRC0_LENGTH                      equ 0001h
ADCON3_SSRC0_MASK                        equ 0001h
ADCON3_SSRC1_POSN                        equ 0001h
ADCON3_SSRC1_POSITION                    equ 0001h
ADCON3_SSRC1_SIZE                        equ 0001h
ADCON3_SSRC1_LENGTH                      equ 0001h
ADCON3_SSRC1_MASK                        equ 0002h
ADCON3_SSRC2_POSN                        equ 0002h
ADCON3_SSRC2_POSITION                    equ 0002h
ADCON3_SSRC2_SIZE                        equ 0001h
ADCON3_SSRC2_LENGTH                      equ 0001h
ADCON3_SSRC2_MASK                        equ 0004h
ADCON3_SSRC3_POSN                        equ 0003h
ADCON3_SSRC3_POSITION                    equ 0003h
ADCON3_SSRC3_SIZE                        equ 0001h
ADCON3_SSRC3_LENGTH                      equ 0001h
ADCON3_SSRC3_MASK                        equ 0008h
ADCON3_SSRC4_POSN                        equ 0004h
ADCON3_SSRC4_POSITION                    equ 0004h
ADCON3_SSRC4_SIZE                        equ 0001h
ADCON3_SSRC4_LENGTH                      equ 0001h
ADCON3_SSRC4_MASK                        equ 0010h
ADCON3_ADRS0_POSN                        equ 0006h
ADCON3_ADRS0_POSITION                    equ 0006h
ADCON3_ADRS0_SIZE                        equ 0001h
ADCON3_ADRS0_LENGTH                      equ 0001h
ADCON3_ADRS0_MASK                        equ 0040h
ADCON3_ADRS1_POSN                        equ 0007h
ADCON3_ADRS1_POSITION                    equ 0007h
ADCON3_ADRS1_SIZE                        equ 0001h
ADCON3_ADRS1_LENGTH                      equ 0001h
ADCON3_ADRS1_MASK                        equ 0080h

