GopalSaraf/Practicals/PSDL/include/proc/pic18lf4431.inc
// Register: TXREG
#define TXREG TXREG
TXREG                                    equ 0FADh

// Register: RCREG
#define RCREG RCREG
RCREG                                    equ 0FAEh

// Register: SPBRG
#define SPBRG SPBRG
SPBRG                                    equ 0FAFh

// Register: SPBRGH
#define SPBRGH SPBRGH
SPBRGH                                   equ 0FB0h

// Register: QEICON
#define QEICON QEICON
QEICON                                   equ 0FB6h
// bitfield definitions
QEICON_UP_NOT_DOWN_POSN                  equ 0005h
QEICON_UP_NOT_DOWN_POSITION              equ 0005h
QEICON_UP_NOT_DOWN_SIZE                  equ 0001h
QEICON_UP_NOT_DOWN_LENGTH                equ 0001h
QEICON_UP_NOT_DOWN_MASK                  equ 0020h
QEICON_NOT_VELM_POSN                     equ 0007h
QEICON_NOT_VELM_POSITION                 equ 0007h
QEICON_NOT_VELM_SIZE                     equ 0001h
QEICON_NOT_VELM_LENGTH                   equ 0001h
QEICON_NOT_VELM_MASK                     equ 0080h
QEICON_PDEC_POSN                         equ 0000h
QEICON_PDEC_POSITION                     equ 0000h
QEICON_PDEC_SIZE                         equ 0002h
QEICON_PDEC_LENGTH                       equ 0002h
QEICON_PDEC_MASK                         equ 0003h
QEICON_QEIM_POSN                         equ 0002h
QEICON_QEIM_POSITION                     equ 0002h
QEICON_QEIM_SIZE                         equ 0003h
QEICON_QEIM_LENGTH                       equ 0003h
QEICON_QEIM_MASK                         equ 001Ch
QEICON_UP_nDOWN_POSN                     equ 0005h
QEICON_UP_nDOWN_POSITION                 equ 0005h
QEICON_UP_nDOWN_SIZE                     equ 0001h
QEICON_UP_nDOWN_LENGTH                   equ 0001h
QEICON_UP_nDOWN_MASK                     equ 0020h
QEICON_QERR_POSN                         equ 0006h
QEICON_QERR_POSITION                     equ 0006h
QEICON_QERR_SIZE                         equ 0001h
QEICON_QERR_LENGTH                       equ 0001h
QEICON_QERR_MASK                         equ 0040h
QEICON_nVELM_POSN                        equ 0007h
QEICON_nVELM_POSITION                    equ 0007h
QEICON_nVELM_SIZE                        equ 0001h
QEICON_nVELM_LENGTH                      equ 0001h
QEICON_nVELM_MASK                        equ 0080h
QEICON_PDEC0_POSN                        equ 0000h
QEICON_PDEC0_POSITION                    equ 0000h
QEICON_PDEC0_SIZE                        equ 0001h
QEICON_PDEC0_LENGTH                      equ 0001h
QEICON_PDEC0_MASK                        equ 0001h
QEICON_PDEC1_POSN                        equ 0001h
QEICON_PDEC1_POSITION                    equ 0001h
QEICON_PDEC1_SIZE                        equ 0001h
QEICON_PDEC1_LENGTH                      equ 0001h
QEICON_PDEC1_MASK                        equ 0002h
QEICON_QEIM0_POSN                        equ 0002h
QEICON_QEIM0_POSITION                    equ 0002h
QEICON_QEIM0_SIZE                        equ 0001h
QEICON_QEIM0_LENGTH                      equ 0001h
QEICON_QEIM0_MASK                        equ 0004h
QEICON_QEIM1_POSN                        equ 0003h
QEICON_QEIM1_POSITION                    equ 0003h
QEICON_QEIM1_SIZE                        equ 0001h
QEICON_QEIM1_LENGTH                      equ 0001h
QEICON_QEIM1_MASK                        equ 0008h
QEICON_QEIM2_POSN                        equ 0004h
QEICON_QEIM2_POSITION                    equ 0004h
QEICON_QEIM2_SIZE                        equ 0001h
QEICON_QEIM2_LENGTH                      equ 0001h
QEICON_QEIM2_MASK                        equ 0010h
QEICON_UP_DOWN_POSN                      equ 0005h
QEICON_UP_DOWN_POSITION                  equ 0005h
QEICON_UP_DOWN_SIZE                      equ 0001h
QEICON_UP_DOWN_LENGTH                    equ 0001h
QEICON_UP_DOWN_MASK                      equ 0020h
QEICON_VELM_POSN                         equ 0007h
QEICON_VELM_POSITION                     equ 0007h
QEICON_VELM_SIZE                         equ 0001h
QEICON_VELM_LENGTH                       equ 0001h
QEICON_VELM_MASK                         equ 0080h
QEICON_UP_POSN                           equ 0005h
QEICON_UP_POSITION                       equ 0005h
QEICON_UP_SIZE                           equ 0001h
QEICON_UP_LENGTH                         equ 0001h
QEICON_UP_MASK                           equ 0020h
QEICON_DOWN_POSN                         equ 0005h
QEICON_DOWN_POSITION                     equ 0005h
QEICON_DOWN_SIZE                         equ 0001h
QEICON_DOWN_LENGTH                       equ 0001h
QEICON_DOWN_MASK                         equ 0020h
QEICON_NOT_DOWN_POSN                     equ 0005h
QEICON_NOT_DOWN_POSITION                 equ 0005h
QEICON_NOT_DOWN_SIZE                     equ 0001h
QEICON_NOT_DOWN_LENGTH                   equ 0001h
QEICON_NOT_DOWN_MASK                     equ 0020h
QEICON_nDOWN_POSN                        equ 0005h
QEICON_nDOWN_POSITION                    equ 0005h
QEICON_nDOWN_SIZE                        equ 0001h
QEICON_nDOWN_LENGTH                      equ 0001h
QEICON_nDOWN_MASK                        equ 0020h
QEICON_UPDOWN_POSN                       equ 0005h
QEICON_UPDOWN_POSITION                   equ 0005h
QEICON_UPDOWN_SIZE                       equ 0001h
QEICON_UPDOWN_LENGTH                     equ 0001h
QEICON_UPDOWN_MASK                       equ 0020h

// Register: T5CON
#define T5CON T5CON
T5CON                                    equ 0FB7h
// bitfield definitions
T5CON_NOT_T5SYNC_POSN                    equ 0002h
T5CON_NOT_T5SYNC_POSITION                equ 0002h
T5CON_NOT_T5SYNC_SIZE                    equ 0001h
T5CON_NOT_T5SYNC_LENGTH                  equ 0001h
T5CON_NOT_T5SYNC_MASK                    equ 0004h
T5CON_NOT_RESEN_POSN                     equ 0006h
T5CON_NOT_RESEN_POSITION                 equ 0006h
T5CON_NOT_RESEN_SIZE                     equ 0001h
T5CON_NOT_RESEN_LENGTH                   equ 0001h
T5CON_NOT_RESEN_MASK                     equ 0040h
T5CON_TMR5ON_POSN                        equ 0000h
T5CON_TMR5ON_POSITION                    equ 0000h
T5CON_TMR5ON_SIZE                        equ 0001h
T5CON_TMR5ON_LENGTH                      equ 0001h
T5CON_TMR5ON_MASK                        equ 0001h
T5CON_TMR5CS_POSN                        equ 0001h
T5CON_TMR5CS_POSITION                    equ 0001h
T5CON_TMR5CS_SIZE                        equ 0001h
T5CON_TMR5CS_LENGTH                      equ 0001h
T5CON_TMR5CS_MASK                        equ 0002h
T5CON_nT5SYNC_POSN                       equ 0002h
T5CON_nT5SYNC_POSITION                   equ 0002h
T5CON_nT5SYNC_SIZE                       equ 0001h
T5CON_nT5SYNC_LENGTH                     equ 0001h
T5CON_nT5SYNC_MASK                       equ 0004h
T5CON_T5PS_POSN                          equ 0003h
T5CON_T5PS_POSITION                      equ 0003h
T5CON_T5PS_SIZE                          equ 0002h
T5CON_T5PS_LENGTH                        equ 0002h
T5CON_T5PS_MASK                          equ 0018h
T5CON_T5MOD_POSN                         equ 0005h
T5CON_T5MOD_POSITION                     equ 0005h
T5CON_T5MOD_SIZE                         equ 0001h
T5CON_T5MOD_LENGTH                       equ 0001h
T5CON_T5MOD_MASK                         equ 0020h
T5CON_nRESEN_POSN                        equ 0006h
T5CON_nRESEN_POSITION                    equ 0006h
T5CON_nRESEN_SIZE                        equ 0001h
T5CON_nRESEN_LENGTH                      equ 0001h
T5CON_nRESEN_MASK                        equ 0040h
T5CON_T5SEN_POSN                         equ 0007h
T5CON_T5SEN_POSITION                     equ 0007h
T5CON_T5SEN_SIZE                         equ 0001h
T5CON_T5SEN_LENGTH                       equ 0001h
T5CON_T5SEN_MASK                         equ 0080h
T5CON_T5SYNC_POSN                        equ 0002h
T5CON_T5SYNC_POSITION                    equ 0002h
T5CON_T5SYNC_SIZE                        equ 0001h
T5CON_T5SYNC_LENGTH                      equ 0001h
T5CON_T5SYNC_MASK                        equ 0004h
T5CON_T5PS0_POSN                         equ 0003h
T5CON_T5PS0_POSITION                     equ 0003h
T5CON_T5PS0_SIZE                         equ 0001h
T5CON_T5PS0_LENGTH                       equ 0001h
T5CON_T5PS0_MASK                         equ 0008h
T5CON_T5PS1_POSN                         equ 0004h
T5CON_T5PS1_POSITION                     equ 0004h
T5CON_T5PS1_SIZE                         equ 0001h
T5CON_T5PS1_LENGTH                       equ 0001h
T5CON_T5PS1_MASK                         equ 0010h
T5CON_RESEN_POSN                         equ 0006h
T5CON_RESEN_POSITION                     equ 0006h
T5CON_RESEN_SIZE                         equ 0001h
T5CON_RESEN_LENGTH                       equ 0001h
T5CON_RESEN_MASK                         equ 0040h
T5CON_RD165_POSN                         equ 0001h
T5CON_RD165_POSITION                     equ 0001h
T5CON_RD165_SIZE                         equ 0001h
T5CON_RD165_LENGTH                       equ 0001h
T5CON_RD165_MASK                         equ 0002h
T5CON_SOSCEN5_POSN                       equ 0003h
T5CON_SOSCEN5_POSITION                   equ 0003h
T5CON_SOSCEN5_SIZE                       equ 0001h
T5CON_SOSCEN5_LENGTH                     equ 0001h
T5CON_SOSCEN5_MASK                       equ 0008h

// Register: ANSEL0
#define ANSEL0 ANSEL0
ANSEL0                                   equ 0FB8h
// bitfield definitions
ANSEL0_ANS0_POSN                         equ 0000h
ANSEL0_ANS0_POSITION                     equ 0000h
ANSEL0_ANS0_SIZE                         equ 0001h
ANSEL0_ANS0_LENGTH                       equ 0001h
ANSEL0_ANS0_MASK                         equ 0001h
ANSEL0_ANS1_POSN                         equ 0001h
ANSEL0_ANS1_POSITION                     equ 0001h
ANSEL0_ANS1_SIZE                         equ 0001h
ANSEL0_ANS1_LENGTH                       equ 0001h
ANSEL0_ANS1_MASK                         equ 0002h
ANSEL0_ANS2_POSN                         equ 0002h
ANSEL0_ANS2_POSITION                     equ 0002h
ANSEL0_ANS2_SIZE                         equ 0001h
ANSEL0_ANS2_LENGTH                       equ 0001h
ANSEL0_ANS2_MASK                         equ 0004h
ANSEL0_ANS3_POSN                         equ 0003h
ANSEL0_ANS3_POSITION                     equ 0003h
ANSEL0_ANS3_SIZE                         equ 0001h
ANSEL0_ANS3_LENGTH                       equ 0001h
ANSEL0_ANS3_MASK                         equ 0008h
ANSEL0_ANS4_POSN                         equ 0004h
ANSEL0_ANS4_POSITION                     equ 0004h
ANSEL0_ANS4_SIZE                         equ 0001h
ANSEL0_ANS4_LENGTH                       equ 0001h
ANSEL0_ANS4_MASK                         equ 0010h
ANSEL0_ANS5_POSN                         equ 0005h
ANSEL0_ANS5_POSITION                     equ 0005h
ANSEL0_ANS5_SIZE                         equ 0001h
ANSEL0_ANS5_LENGTH                       equ 0001h
ANSEL0_ANS5_MASK                         equ 0020h
ANSEL0_ANS6_POSN                         equ 0006h
ANSEL0_ANS6_POSITION                     equ 0006h
ANSEL0_ANS6_SIZE                         equ 0001h
ANSEL0_ANS6_LENGTH                       equ 0001h
ANSEL0_ANS6_MASK                         equ 0040h
ANSEL0_ANS7_POSN                         equ 0007h
ANSEL0_ANS7_POSITION                     equ 0007h
ANSEL0_ANS7_SIZE                         equ 0001h
ANSEL0_ANS7_LENGTH                       equ 0001h
ANSEL0_ANS7_MASK                         equ 0080h

// Register: ANSEL1
#define ANSEL1 ANSEL1
ANSEL1                                   equ 0FB9h
// bitfield definitions
ANSEL1_ANS8_POSN                         equ 0000h
ANSEL1_ANS8_POSITION                     equ 0000h
ANSEL1_ANS8_SIZE                         equ 0001h
ANSEL1_ANS8_LENGTH                       equ 0001h
ANSEL1_ANS8_MASK                         equ 0001h

// Register: CCP2CON
#define CCP2CON CCP2CON
CCP2CON                                  equ 0FBAh
// bitfield definitions
CCP2CON_CCP2M_POSN                       equ 0000h
CCP2CON_CCP2M_POSITION                   equ 0000h
CCP2CON_CCP2M_SIZE                       equ 0004h
CCP2CON_CCP2M_LENGTH                     equ 0004h
CCP2CON_CCP2M_MASK                       equ 000Fh
CCP2CON_DC2B_POSN                        equ 0004h
CCP2CON_DC2B_POSITION                    equ 0004h
CCP2CON_DC2B_SIZE                        equ 0002h
CCP2CON_DC2B_LENGTH                      equ 0002h
CCP2CON_DC2B_MASK                        equ 0030h
CCP2CON_CCP2M0_POSN                      equ 0000h
CCP2CON_CCP2M0_POSITION                  equ 0000h
CCP2CON_CCP2M0_SIZE                      equ 0001h
CCP2CON_CCP2M0_LENGTH                    equ 0001h
CCP2CON_CCP2M0_MASK                      equ 0001h
CCP2CON_CCP2M1_POSN                      equ 0001h
CCP2CON_CCP2M1_POSITION                  equ 0001h
CCP2CON_CCP2M1_SIZE                      equ 0001h
CCP2CON_CCP2M1_LENGTH                    equ 0001h
CCP2CON_CCP2M1_MASK                      equ 0002h
CCP2CON_CCP2M2_POSN                      equ 0002h
CCP2CON_CCP2M2_POSITION                  equ 0002h
CCP2CON_CCP2M2_SIZE                      equ 0001h
CCP2CON_CCP2M2_LENGTH                    equ 0001h
CCP2CON_CCP2M2_MASK                      equ 0004h
CCP2CON_CCP2M3_POSN                      equ 0003h
CCP2CON_CCP2M3_POSITION                  equ 0003h
CCP2CON_CCP2M3_SIZE                      equ 0001h
CCP2CON_CCP2M3_LENGTH                    equ 0001h
CCP2CON_CCP2M3_MASK                      equ 0008h
CCP2CON_CCP2Y_POSN                       equ 0004h
CCP2CON_CCP2Y_POSITION                   equ 0004h
CCP2CON_CCP2Y_SIZE                       equ 0001h
CCP2CON_CCP2Y_LENGTH                     equ 0001h
CCP2CON_CCP2Y_MASK                       equ 0010h
CCP2CON_CCP2X_POSN                       equ 0005h
CCP2CON_CCP2X_POSITION                   equ 0005h
CCP2CON_CCP2X_SIZE                       equ 0001h
CCP2CON_CCP2X_LENGTH                     equ 0001h
CCP2CON_CCP2X_MASK                       equ 0020h
CCP2CON_DC2B0_POSN                       equ 0004h
CCP2CON_DC2B0_POSITION                   equ 0004h
CCP2CON_DC2B0_SIZE                       equ 0001h
CCP2CON_DC2B0_LENGTH                     equ 0001h
CCP2CON_DC2B0_MASK                       equ 0010h
CCP2CON_DC2B1_POSN                       equ 0005h
CCP2CON_DC2B1_POSITION                   equ 0005h
CCP2CON_DC2B1_SIZE                       equ 0001h
CCP2CON_DC2B1_LENGTH                     equ 0001h
CCP2CON_DC2B1_MASK                       equ 0020h

// Register: CCPR2
#define CCPR2 CCPR2
CCPR2                                    equ 0FBBh

// Register: CCPR2L
#define CCPR2L CCPR2L
CCPR2L                                   equ 0FBBh

