GopalSaraf/Practicals/PSDL/include/proc/pic18lf4431.inc
#define PC2                              BANKMASK(PORTE), 1, a
#define PC3E                             BANKMASK(PORTE), 3, a
#define PD                               BANKMASK(RCON), 2, a
#define PD2                              BANKMASK(PORTE), 0, a
#define PDEC0                            BANKMASK(QEICON), 0, a
#define PDEC1                            BANKMASK(QEICON), 1, a
#define PEIE                             BANKMASK(INTCON), 6, a
#define PEIE_GIEL                        BANKMASK(INTCON), 6, a
#define PMOD0                            BANKMASK(PWMCON0), 0, a
#define PMOD1                            BANKMASK(PWMCON0), 1, a
#define PMOD2                            BANKMASK(PWMCON0), 2, a
#define PMOD3                            BANKMASK(PWMCON0), 3, a
#define POR                              BANKMASK(RCON), 1, a
#define POUT0                            BANKMASK(OVDCONS), 0, a
#define POUT1                            BANKMASK(OVDCONS), 1, a
#define POUT2                            BANKMASK(OVDCONS), 2, a
#define POUT3                            BANKMASK(OVDCONS), 3, a
#define POUT4                            BANKMASK(OVDCONS), 4, a
#define POUT5                            BANKMASK(OVDCONS), 5, a
#define POUT6                            BANKMASK(OVDCONS), 6, a
#define POUT7                            BANKMASK(OVDCONS), 7, a
#define POVD0                            BANKMASK(OVDCOND), 0, a
#define POVD1                            BANKMASK(OVDCOND), 1, a
#define POVD2                            BANKMASK(OVDCOND), 2, a
#define POVD3                            BANKMASK(OVDCOND), 3, a
#define POVD4                            BANKMASK(OVDCOND), 4, a
#define POVD5                            BANKMASK(OVDCOND), 5, a
#define POVD6                            BANKMASK(OVDCOND), 6, a
#define POVD7                            BANKMASK(OVDCOND), 7, a
#define PSA                              BANKMASK(T0CON), 3, a
#define PTCKPS0                          BANKMASK(PTCON0), 2, a
#define PTCKPS1                          BANKMASK(PTCON0), 3, a
#define PTDIR                            BANKMASK(PTCON1), 6, a
#define PTEN                             BANKMASK(PTCON1), 7, a
#define PTIE                             BANKMASK(PIE3), 4, a
#define PTIF                             BANKMASK(PIR3), 4, a
#define PTIP                             BANKMASK(IPR3), 4, a
#define PTMOD0                           BANKMASK(PTCON0), 0, a
#define PTMOD1                           BANKMASK(PTCON0), 1, a
#define PTOPS0                           BANKMASK(PTCON0), 4, a
#define PTOPS1                           BANKMASK(PTCON0), 5, a
#define PTOPS2                           BANKMASK(PTCON0), 6, a
#define PTOPS3                           BANKMASK(PTCON0), 7, a
#define PWMEN0                           BANKMASK(PWMCON0), 4, a
#define PWMEN1                           BANKMASK(PWMCON0), 5, a
#define PWMEN2                           BANKMASK(PWMCON0), 6, a
#define QEIM0                            BANKMASK(QEICON), 2, a
#define QEIM1                            BANKMASK(QEICON), 3, a
#define QEIM2                            BANKMASK(QEICON), 4, a
#define QERR                             BANKMASK(QEICON), 6, a
#define RBIE                             BANKMASK(INTCON), 3, a
#define RBIF                             BANKMASK(INTCON), 0, a
#define RBIP                             BANKMASK(INTCON2), 0, a
#define RBPU                             BANKMASK(INTCON2), 7, a
#define RC1IE                            BANKMASK(PIE1), 5, a
#define RC1IF                            BANKMASK(PIR1), 5, a
#define RC1IP                            BANKMASK(IPR1), 5, a
#define RC8_9                            BANKMASK(RCSTA), 6, a
#define RC9                              BANKMASK(RCSTA), 6, a
#define RCD8                             BANKMASK(RCSTA), 0, a
#define RCIDL                            BANKMASK(BAUDCON), 6, a
#define RCIE                             BANKMASK(PIE1), 5, a
#define RCIF                             BANKMASK(PIR1), 5, a
#define RCIP                             BANKMASK(IPR1), 5, a
#define RCMT                             BANKMASK(BAUDCON), 6, a
#define RD                               BANKMASK(EECON1), 0, a
#define RD16                             BANKMASK(T1CON), 7, a
#define RD165                            BANKMASK(T5CON), 1, a
#define RDE                              BANKMASK(PORTE), 0, a
#define RE3                              BANKMASK(PORTE), 3, a
#define READ_WRITE                       BANKMASK(SSPSTAT), 2, a
#define RESEN                            BANKMASK(T5CON), 6, a
#define RI                               BANKMASK(RCON), 4, a
#define RJPU                             BANKMASK(PORTA), 7, a
#define RW                               BANKMASK(SSPSTAT), 2, a
#define RX                               BANKMASK(PORTC), 7, a
#define RX9                              BANKMASK(RCSTA), 6, a
#define RX9D                             BANKMASK(RCSTA), 0, a
#define RXB0IE                           BANKMASK(PIE3), 0, a
#define RXB1IE                           BANKMASK(PIE3), 1, a
#define RXBNIE                           BANKMASK(PIE3), 1, a
#define RXBNIF                           BANKMASK(PIR3), 1, a
#define RXBNIP                           BANKMASK(IPR3), 1, a
#define RXCKP                            BANKMASK(BAUDCON), 5, a
#define RXDTP                            BANKMASK(BAUDCON), 5, a
#define R_NOT_W                          BANKMASK(SSPSTAT), 2, a
#define R_W                              BANKMASK(SSPSTAT), 2, a
#define R_nW                             BANKMASK(SSPSTAT), 2, a
#define SASEL0                           BANKMASK(ADCHS), 0, a
#define SASEL1                           BANKMASK(ADCHS), 1, a
#define SBSEL0                           BANKMASK(ADCHS), 4, a
#define SBSEL1                           BANKMASK(ADCHS), 5, a
#define SCK                              BANKMASK(PORTC), 5, a
#define SCKP                             BANKMASK(BAUDCON), 4, a
#define SCL                              BANKMASK(PORTC), 5, a
#define SCS0                             BANKMASK(OSCCON), 0, a
#define SCS1                             BANKMASK(OSCCON), 1, a
#define SCSEL0                           BANKMASK(ADCHS), 2, a
#define SCSEL1                           BANKMASK(ADCHS), 3, a
#define SDA                              BANKMASK(PORTC), 4, a
#define SDI                              BANKMASK(PORTC), 4, a
#define SDO                              BANKMASK(PORTC), 7, a
#define SDSEL0                           BANKMASK(ADCHS), 6, a
#define SDSEL1                           BANKMASK(ADCHS), 7, a
#define SENDB                            BANKMASK(TXSTA), 3, a
#define SENDB1                           BANKMASK(TXSTA), 3, a
#define SEVOPS0                          BANKMASK(PWMCON1), 4, a
#define SEVOPS1                          BANKMASK(PWMCON1), 5, a
#define SEVOPS2                          BANKMASK(PWMCON1), 6, a
#define SEVOPS3                          BANKMASK(PWMCON1), 7, a
#define SEVTDIR                          BANKMASK(PWMCON1), 3, a
#define SMP                              BANKMASK(SSPSTAT), 7, a
#define SOSCEN                           BANKMASK(T1CON), 3, a
#define SOSCEN5                          BANKMASK(T5CON), 3, a
#define SPEN                             BANKMASK(RCSTA), 7, a
#define SREN                             BANKMASK(RCSTA), 5, a
#define SRENA                            BANKMASK(RCSTA), 5, a
#define SS                               BANKMASK(PORTC), 6, a
#define SS2                              BANKMASK(PORTD), 7, a
#define SSPEN                            BANKMASK(SSPCON), 5, a
#define SSPIE                            BANKMASK(PIE1), 3, a
#define SSPIF                            BANKMASK(PIR1), 3, a
#define SSPIP                            BANKMASK(IPR1), 3, a
#define SSPM0                            BANKMASK(SSPCON), 0, a
#define SSPM1                            BANKMASK(SSPCON), 1, a
#define SSPM2                            BANKMASK(SSPCON), 2, a
#define SSPM3                            BANKMASK(SSPCON), 3, a
#define SSPOV                            BANKMASK(SSPCON), 6, a
#define SSRC0                            BANKMASK(ADCON3), 0, a
#define SSRC1                            BANKMASK(ADCON3), 1, a
#define SSRC2                            BANKMASK(ADCON3), 2, a
#define SSRC3                            BANKMASK(ADCON3), 3, a
#define SSRC4                            BANKMASK(ADCON3), 4, a
#define START                            BANKMASK(SSPSTAT), 3, a
#define STKFUL                           BANKMASK(STKPTR), 7, a
#define STKOVF                           BANKMASK(STKPTR), 7, a
#define STKPTR0                          BANKMASK(STKPTR), 0, a
#define STKPTR1                          BANKMASK(STKPTR), 1, a
#define STKPTR2                          BANKMASK(STKPTR), 2, a
#define STKPTR3                          BANKMASK(STKPTR), 3, a
#define STKPTR4                          BANKMASK(STKPTR), 4, a
#define STKUNF                           BANKMASK(STKPTR), 6, a
#define STOP                             BANKMASK(SSPSTAT), 4, a
#define SWDTEN                           BANKMASK(WDTCON), 0, a
#define SYNC                             BANKMASK(TXSTA), 4, a
#define SYNC1                            BANKMASK(TXSTA), 4, a
#define T016BIT                          BANKMASK(T0CON), 6, a
#define T0CKI                            BANKMASK(PORTC), 3, a
#define T0CS                             BANKMASK(T0CON), 5, a
#define T0IE                             BANKMASK(INTCON), 5, a
#define T0IF                             BANKMASK(INTCON), 2, a
#define T0IP                             BANKMASK(INTCON2), 2, a
#define T0PS0                            BANKMASK(T0CON), 0, a
#define T0PS1                            BANKMASK(T0CON), 1, a
#define T0PS2                            BANKMASK(T0CON), 2, a
#define T0PS3                            BANKMASK(T0CON), 3, a
#define T0SE                             BANKMASK(T0CON), 4, a
#define T13CKI                           BANKMASK(PORTC), 0, a
#define T1CKPS0                          BANKMASK(T1CON), 4, a
#define T1CKPS1                          BANKMASK(T1CON), 5, a
#define T1INSYNC                         BANKMASK(T1CON), 2, a
#define T1OSCEN                          BANKMASK(T1CON), 3, a
#define T1OSI                            BANKMASK(PORTC), 1, a
#define T1OSO                            BANKMASK(PORTC), 0, a
#define T1RD16                           BANKMASK(T1CON), 7, a
#define T1RUN                            BANKMASK(T1CON), 6, a
#define T1SYNC                           BANKMASK(T1CON), 2, a
#define T2CKPS0                          BANKMASK(T2CON), 0, a
#define T2CKPS1                          BANKMASK(T2CON), 1, a
#define T2OUTPS0                         BANKMASK(T2CON), 3, a
#define T2OUTPS1                         BANKMASK(T2CON), 4, a
#define T2OUTPS2                         BANKMASK(T2CON), 5, a
#define T2OUTPS3                         BANKMASK(T2CON), 6, a
#define T5CKI                            BANKMASK(PORTC), 3, a
#define T5MOD                            BANKMASK(T5CON), 5, a
#define T5PS0                            BANKMASK(T5CON), 3, a
#define T5PS1                            BANKMASK(T5CON), 4, a
#define T5SEN                            BANKMASK(T5CON), 7, a
#define T5SYNC                           BANKMASK(T5CON), 2, a
#define TBIE                             BANKMASK(PIE1), 4, a
#define TBIF                             BANKMASK(PIR1), 4, a
#define TBIP                             BANKMASK(IPR1), 4, a
#define TMR0IE                           BANKMASK(INTCON), 5, a
#define TMR0IF                           BANKMASK(INTCON), 2, a
#define TMR0IP                           BANKMASK(INTCON2), 2, a
#define TMR0ON                           BANKMASK(T0CON), 7, a
#define TMR1CS                           BANKMASK(T1CON), 1, a
#define TMR1IE                           BANKMASK(PIE1), 0, a
#define TMR1IF                           BANKMASK(PIR1), 0, a
#define TMR1IP                           BANKMASK(IPR1), 0, a
#define TMR1ON                           BANKMASK(T1CON), 0, a
#define TMR2IE                           BANKMASK(PIE1), 1, a
#define TMR2IF                           BANKMASK(PIR1), 1, a
#define TMR2IP                           BANKMASK(IPR1), 1, a
#define TMR2ON                           BANKMASK(T2CON), 2, a
#define TMR5CS                           BANKMASK(T5CON), 1, a
#define TMR5IE                           BANKMASK(PIE3), 0, a
#define TMR5IF                           BANKMASK(PIR3), 0, a
#define TMR5IP                           BANKMASK(IPR3), 0, a
#define TMR5ON                           BANKMASK(T5CON), 0, a
#define TO                               BANKMASK(RCON), 3, a
#define TOUTPS0                          BANKMASK(T2CON), 3, a
#define TOUTPS1                          BANKMASK(T2CON), 4, a
#define TOUTPS2                          BANKMASK(T2CON), 5, a
#define TOUTPS3                          BANKMASK(T2CON), 6, a
#define TRISA0                           BANKMASK(TRISA), 0, a
#define TRISA1                           BANKMASK(TRISA), 1, a
#define TRISA2                           BANKMASK(TRISA), 2, a
#define TRISA3                           BANKMASK(TRISA), 3, a
#define TRISA4                           BANKMASK(TRISA), 4, a
#define TRISA5                           BANKMASK(TRISA), 5, a
#define TRISA6                           BANKMASK(TRISA), 6, a
#define TRISA7                           BANKMASK(TRISA), 7, a
#define TRISB0                           BANKMASK(TRISB), 0, a
#define TRISB1                           BANKMASK(TRISB), 1, a
#define TRISB2                           BANKMASK(TRISB), 2, a
#define TRISB3                           BANKMASK(TRISB), 3, a
#define TRISB4                           BANKMASK(TRISB), 4, a
#define TRISB5                           BANKMASK(TRISB), 5, a
#define TRISB6                           BANKMASK(TRISB), 6, a
#define TRISB7                           BANKMASK(TRISB), 7, a
#define TRISC0                           BANKMASK(TRISC), 0, a
#define TRISC1                           BANKMASK(TRISC), 1, a
#define TRISC2                           BANKMASK(TRISC), 2, a
#define TRISC3                           BANKMASK(TRISC), 3, a
#define TRISC4                           BANKMASK(TRISC), 4, a
#define TRISC5                           BANKMASK(TRISC), 5, a
#define TRISC6                           BANKMASK(TRISC), 6, a
#define TRISC7                           BANKMASK(TRISC), 7, a
#define TRISD0                           BANKMASK(TRISD), 0, a
#define TRISD1                           BANKMASK(TRISD), 1, a
#define TRISD2                           BANKMASK(TRISD), 2, a
#define TRISD3                           BANKMASK(TRISD), 3, a
#define TRISD4                           BANKMASK(TRISD), 4, a
#define TRISD5                           BANKMASK(TRISD), 5, a
#define TRISD6                           BANKMASK(TRISD), 6, a
#define TRISD7                           BANKMASK(TRISD), 7, a
#define TRISE0                           BANKMASK(TRISE), 0, a
#define TRISE1                           BANKMASK(TRISE), 1, a
#define TRISE2                           BANKMASK(TRISE), 2, a
#define TRMT                             BANKMASK(TXSTA), 1, a
#define TRMT1                            BANKMASK(TXSTA), 1, a
#define TUN0                             BANKMASK(OSCTUNE), 0, a
#define TUN1                             BANKMASK(OSCTUNE), 1, a
#define TUN2                             BANKMASK(OSCTUNE), 2, a
#define TUN3                             BANKMASK(OSCTUNE), 3, a
#define TUN4                             BANKMASK(OSCTUNE), 4, a
#define TUN5                             BANKMASK(OSCTUNE), 5, a
#define TX                               BANKMASK(PORTC), 6, a
#define TX1IE                            BANKMASK(PIE1), 4, a
#define TX1IF                            BANKMASK(PIR1), 4, a
#define TX1IP                            BANKMASK(IPR1), 4, a
#define TX8_9                            BANKMASK(TXSTA), 6, a
#define TX9                              BANKMASK(TXSTA), 6, a
#define TX91                             BANKMASK(TXSTA), 6, a
#define TX9D                             BANKMASK(TXSTA), 0, a
#define TX9D1                            BANKMASK(TXSTA), 0, a
#define TXB0IE                           BANKMASK(PIE3), 2, a
#define TXB1IE                           BANKMASK(PIE3), 3, a
#define TXB2IE                           BANKMASK(PIE3), 4, a
#define TXBNIE                           BANKMASK(PIE3), 4, a
#define TXBNIF                           BANKMASK(PIR3), 4, a
#define TXBNIP                           BANKMASK(IPR3), 4, a
#define TXCKP                            BANKMASK(BAUDCON), 4, a
#define TXD8                             BANKMASK(TXSTA), 0, a
#define TXEN                             BANKMASK(TXSTA), 5, a
#define TXEN1                            BANKMASK(TXSTA), 5, a
#define TXIE                             BANKMASK(PIE1), 4, a
#define TXIF                             BANKMASK(PIR1), 4, a
#define TXIP                             BANKMASK(IPR1), 4, a
#define UA                               BANKMASK(SSPSTAT), 1, a
#define UDIS                             BANKMASK(PWMCON1), 1, a
#define ULPWUIN                          BANKMASK(PORTA), 0, a
#define UP                               BANKMASK(QEICON), 5, a
#define UPDOWN                           BANKMASK(QEICON), 5, a
#define UP_DOWN                          BANKMASK(QEICON), 5, a
#define UP_NOT_DOWN                      BANKMASK(QEICON), 5, a
#define UP_nDOWN                         BANKMASK(QEICON), 5, a
#define VCFG0                            BANKMASK(ADCON1), 6, a
#define VCFG01                           BANKMASK(ADCON1), 4, a
#define VCFG1                            BANKMASK(ADCON1), 7, a
#define VELM                             BANKMASK(QEICON), 7, a
#define VREFM                            BANKMASK(PORTA), 2, a
#define VREFP                            BANKMASK(PORTA), 3, a
#define W4E                              BANKMASK(BAUDCON), 1, a
#define WAIT0                            BANKMASK(PR2), 4, a
#define WAIT1                            BANKMASK(PR2), 5, a
#define WCOL                             BANKMASK(SSPCON), 7, a
#define WDTW                             BANKMASK(WDTCON), 7, a
#define WM0                              BANKMASK(PR2), 0, a
#define WM1                              BANKMASK(PR2), 1, a
#define WR                               BANKMASK(EECON1), 1, a
#define WRE                              BANKMASK(PORTE), 1, a
#define WREN                             BANKMASK(EECON1), 2, a
#define WRERR                            BANKMASK(EECON1), 3, a
#define WUE                              BANKMASK(BAUDCON), 1, a
#define ZERO                             BANKMASK(STATUS), 2, a
#define nA                               BANKMASK(SSPSTAT), 5, a
#define nADDRESS                         BANKMASK(SSPSTAT), 5, a
#define nBOR                             BANKMASK(RCON), 0, a
#define nDONE                            BANKMASK(ADCON0), 1, a
#define nDOWN                            BANKMASK(QEICON), 5, a
#define nFLTA                            BANKMASK(PORTC), 1, a
#define nFLTB                            BANKMASK(PORTC), 2, a
#define nIPEN                            BANKMASK(RCON), 7, a
#define nMCLR                            BANKMASK(PORTE), 3, a
#define nPD                              BANKMASK(RCON), 2, a
#define nPOR                             BANKMASK(RCON), 1, a
#define nRBPU                            BANKMASK(INTCON2), 7, a
#define nRESEN                           BANKMASK(T5CON), 6, a
#define nRI                              BANKMASK(RCON), 4, a
#define nSS                              BANKMASK(PORTC), 6, a
#define nT1SYNC                          BANKMASK(T1CON), 2, a
#define nT5SYNC                          BANKMASK(T5CON), 2, a
#define nTO                              BANKMASK(RCON), 3, a
#define nVELM                            BANKMASK(QEICON), 7, a
#define nW                               BANKMASK(SSPSTAT), 2, a
#define nWRITE                           BANKMASK(SSPSTAT), 2, a

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

#if _COMMON_SIZE_
psect udata_acs,class=COMRAM,space=SPACE_DATA,noexec,lowdata
#endif
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec,lowdata
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec,lowdata
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec,lowdata
psect udata,class=RAM,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,reloc=2
psect data,class=CONST,space=SPACE_CODE,reloc=2,noexec
psect edata,class=EEDATA,space=SPACE_EEPROM,delta=1,noexec

#endif // _XC_INC_

#endif // _PIC18LF4431_INC_
